Catalogs/РегистрируемыеЭлектронныеМедДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РегистрируемыеЭлектронныеМедДокументы</Name>
			<Comment>1.2.643.5.1.13.13.11.1520</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схематрон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаВизуализации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Атрибуты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СообщенияРЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СообщенияРЭМД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоследнейОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрируемыеЭлектронныеМедДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРЭМД</Name>
					<Comment>emdrId</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторШаблонаЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереотправок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВПроцессеРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлектронныеПодписиЭМД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлуПодписиЭМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольРЭМД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПриПодписиМедДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПодписьМО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД_ЭЦП</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьМинздрава</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпециальностьМинздрава</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Версии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлуЭМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/АРМПодписанияМедицинскойДокументации/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеМД.Параметры.УстановитьЗначениеПараметра("ОтмеченныеМД", Новый Массив());
	ДанныеМД.Параметры.УстановитьЗначениеПараметра("ПустойУИД", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ДанныеМД.Параметры.УстановитьЗначениеПараметра("ВидыДокументовСПодписьюМО", ПолучитьВидыДокументовСПодписьюМО());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьАвтоРегистрациюВРЭМД(Команда)
	
	СообщенияРЭМДКОтправке = ИнтеграцияЕГИСЗ_РЭМД.ПолучитьПодготовленныеСообщенияРЭМД();
	
	ДостигнутЛимит = Ложь;
	Для Каждого СообщениеРЭМД Из СообщенияРЭМДКОтправке Цикл
		ИнтеграцияЕГИСЗ_РЭМДКлиент.ЗарегистрироватьДокументВРЭМД(СообщениеРЭМД, ДостигнутЛимит);
		Если ДостигнутЛимит Тогда
			Сообщить(НСтр("ru='Превышен лимит запросов к сервису.'"));
			Прервать;
		КонецЕсли;
		Прогресс = Окр(СообщенияРЭМДКОтправке.Найти(СообщениеРЭМД) * 100 / СообщенияРЭМДКОтправке.Количество());
		Состояние("Выполняется отправка сообщений в РЭМД...", Прогресс);
	КонецЦикла;
	
	Элементы.ДанныеКРегистрации.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьОтмеченныеДокументы(Команда)
	
	мДанныеДляПодписи = ПодписатьОтмеченныеДокументыНаСервере();
	Если мДанныеДляПодписи.Количество() > 0 Тогда
		ПодписатьФайлЭМДВРоли(мДанныеДляПодписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	СнятьВсеОтметкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметку(Команда)
	
	ПоявилисьНовыеОтметки = Ложь;
	
	Для Каждого СообщениеРЭМД Из Элементы.ДанныеМД.ВыделенныеСтроки Цикл
		Если СообщенияДляПодписи.НайтиПоЗначению(СообщениеРЭМД) = Неопределено Тогда
			СообщенияДляПодписи.Добавить(СообщениеРЭМД, "");
			ПоявилисьНовыеОтметки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ПоявилисьНовыеОтметки Тогда
		ОтметитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	
	ВД = Элементы.ДанныеМД.ВыделенныеСтроки;
	ПоявилисьНовыеОтметки = Ложь;
	
	Для Каждого ВДИдентификатор Из ВД Цикл
		НайденныйЭлемент = СообщенияДляПодписи.НайтиПоЗначению(ВДИдентификатор);
		Если НайденныйЭлемент <> Неопределено Тогда 
			СообщенияДляПодписи.Удалить(НайденныйЭлемент);
			ПоявилисьНовыеОтметки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ПоявилисьНовыеОтметки Тогда
		СнятьОтметкуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеОтметки(Команда)
	УстановитьВсеОтметкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьСообщенияВРЭМД(Команда)
	
	ДостигнутЛимит = Ложь;
	Для Каждого СообщениеРЭМД Из Элементы.ДанныеКРегистрации.ВыделенныеСтроки Цикл
		Если ЗначениеЗаполнено(СообщениеРЭМД) Тогда
			ИнтеграцияЕГИСЗ_РЭМДКлиент.ЗарегистрироватьДокументВРЭМД(СообщениеРЭМД, ДостигнутЛимит);
			Если ДостигнутЛимит Тогда
				Сообщить(НСтр("ru='Превышен лимит запросов к сервису.'"));
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ДанныеКРегистрации.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДанныеМДНаПодписьПриИзменении(Элемент)
	
	ТД = Элементы.ДанныеМД.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		
		НайденныйЭлемент = СообщенияДляПодписи.НайтиПоЗначению(ТД.Ссылка);
		// Флажок взвели и это сообщение не состояло в списк отмеченных - добавим его туда и обновим параметры на сервере.
		Если НайденныйЭлемент = Неопределено И ТД.НаПодпись Тогда
			СообщенияДляПодписи.Добавить(ТД.Ссылка, "");
			ОтметитьНаСервере();
			
		// Флажок сняли и это сообщение состояло в списк отмеченных - удалим его оттуда и обновим параметры на сервере.
		ИначеЕсли НайденныйЭлемент <> Неопределено И Не ТД.НаПодпись Тогда
			СообщенияДляПодписи.Удалить(НайденныйЭлемент);
			ОтметитьНаСервере();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеМДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено
		И Элемент.ТекущийЭлемент = Элементы.ДанныеМДДокумент
	Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКРегистрацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено
		И Элемент.ТекущийЭлемент = Элементы.ДанныеКРегистрацииДокумент
	Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияДляПодписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияДляПодписиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияДляПодписиПослеУдаления(Элемент)
	
	ОтметитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьВидыДокументовСПодписьюМО()
	
	ВидыДокументовСПодписьюМО = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РЭМДАтрибуты.Ссылка КАК Ссылка,
		|	РЭМДАтрибуты.Ключ КАК Ключ,
		|	РЭМДАтрибуты.Значение КАК Значение
		|ИЗ
		|	Справочник.РегистрируемыеЭлектронныеМедДокументы.Атрибуты КАК РЭМДАтрибуты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РегистрируемыеЭлектронныеМедДокументы КАК РЭМД
		|		ПО РЭМДАтрибуты.Ссылка = РЭМД.Ссылка
		|			И (НЕ РЭМД.ПометкаУдаления)
		|			И (НЕ РЭМД.Архив)
		|			И (РЭМДАтрибуты.Ключ = ""MO_SIGN"")";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			Если Булево(Выборка.Значение) Тогда
				ВидыДокументовСПодписьюМО.Добавить(Выборка.Ссылка);
			КонецЕсли;
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	Возврат ВидыДокументовСПодписьюМО;
	
КонецФункции

&НаСервере
Функция ПодписатьОтмеченныеДокументыНаСервере()
	
	мДанныеДляПодписи = Новый Массив();
	Для Каждого КлючИЗначение Из СообщенияДляПодписи Цикл
		ДанныеПодписи = Новый Структура;
		ДанныеПодписи.Вставить("МедицинскийДокумент",	КлючИЗначение.Значение.Документ);
		ДанныеПодписи.Вставить("Роль",					Неопределено);
		ДанныеПодписи.Вставить("УИД",					Новый УникальныйИдентификатор(КлючИЗначение.Значение.ИдентификаторДокумента));
		ДанныеПодписи.Вставить("ПутьКФайлу",			ИнтеграцияЕГИСЗ_РЭМД.ПолучитьПолныйПутьПоОтносительномуПутиВХранилищеЭМД(КлючИЗначение.Значение.ПутьКФайлуЭМД, КлючИЗначение.Значение.Документ.Филиал));
		ДанныеПодписи.Вставить("СообщениеРЭМД",			КлючИЗначение.Значение);
		ДанныеПодписи.Вставить("ПодписываемыеДанные",	ИнтеграцияЕГИСЗВызовСервера.ПолучитьДДФайла(ДанныеПодписи.ПутьКФайлу));
		
		мДанныеДляПодписи.Добавить(ДанныеПодписи);
	КонецЦикла;
	
	Возврат мДанныеДляПодписи;
	
КонецФункции

&НаКлиенте
Процедура ПодписатьФайлЭМДВРолиЗавершение(Результат, Параметры) Экспорт
	
	Если Не Результат.Успех Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось подписать " + Параметры.СообщениеРЭМД);
		Возврат;
	КонецЕсли;
	
	// При сохранении данных подписи надо сохранить признак подписания файла ЭМД.
	Параметры.Вставить("ПодписанФайлЭМД", Истина);
	
	доп_СертификатыЭЦПКлиент.ПослеПодписанияОбъекта(Результат, Параметры);
	мСообщенияСУстановленнымиПодписями = ОбновитьТЧСообщенияРЭМД(Параметры);
	
	Для Каждого Сообщение Из мСообщенияСУстановленнымиПодписями Цикл
		НайденныйЭлемент = СообщенияДляПодписи.НайтиПоЗначению(Сообщение);
		Если НайденныйЭлемент <> Неопределено Тогда 
			СообщенияДляПодписи.Удалить(НайденныйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	Если мСообщенияСУстановленнымиПодписями.Количество() > 0 Тогда
		ОтметитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьТЧСообщенияРЭМД(ПараметрыОбновления)
	
	Возврат Справочники.СообщенияРЭМД.ОбновитьТЧСообщенияРЭМД(ПараметрыОбновления);
	
КонецФункции

&НаКлиенте
Процедура ПодписатьФайлЭМДВРоли(мДанныеДляПодписи)
	
	Объекты = Новый Массив;
	Для Каждого ДанныеДляПодписи Из мДанныеДляПодписи Цикл
		Объекты.Добавить(ДанныеДляПодписи.МедицинскийДокумент);
	КонецЦикла;
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("Объекты", Объекты);
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПодписатьФайлЭМДВРолиЗавершение", ЭтотОбъект, ПараметрыОбработчика);
	
	НаборДанных = Новый Массив;
	МассивДанныхОбъектов = Новый Массив;
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("ОбработчикЗавершения", ОбработчикЗавершения);
	ПараметрыВыполнения.Вставить("ИдентификаторФормы",	 УникальныйИдентификатор);
	ПараметрыВыполнения.Вставить("МассивДанныхОбъектов", МассивДанныхОбъектов);
	
	Для Каждого ОбъектМ Из мДанныеДляПодписи Цикл
		
		МассивДанныхОбъектов.Добавить(ОбъектМ);
		
		ТекущиеПараметрыВыполнения = Новый Структура;
		ТекущиеПараметрыВыполнения.Вставить("ИдентификаторФормы",	УникальныйИдентификатор);
		ТекущиеПараметрыВыполнения.Вставить("ПодписываемыеДанные",	ОбъектМ.ПодписываемыеДанные);
		
		ЭлементДанных = Новый Структура;
		ЭлементДанных.Вставить("Представление",		ОбъектМ.МедицинскийДокумент);
		ЭлементДанных.Вставить("Данные",			ОбъектМ.ПодписываемыеДанные);
		ЭлементДанных.Вставить("Объект",			Новый ОписаниеОповещения("ПриПолученииПодписи", ОбщегоНазначенияКлиент.ОбщийМодуль("доп_СертификатыЭЦПКлиент"), ТекущиеПараметрыВыполнения));
		ЭлементДанных.Вставить("СообщениеРЭМД",		ОбъектМ.СообщениеРЭМД);
		ЭлементДанных.Вставить("ИмяФайла",			ОбъектМ.ПутьКФайлу);
		ЭлементДанных.Вставить("Роль",				ОбъектМ.Роль);
		ЭлементДанных.Вставить("УИД",				ОбъектМ.УИД);
		ЭлементДанных.Вставить("ПодписанФайлЭМД",	Истина);
		ЭлементДанных.Вставить("ИдентификаторРоли",	Неопределено);
		
		НаборДанных.Добавить(ЭлементДанных);
		
	КонецЦикла;
	
	Операция = НСтр("ru = 'Подписание'");
	ЗаголовкиСтруктура = Новый Структура;
	ЗаголовкиСтруктура.Вставить("ЗаголовокДанных");
	ЗаголовокДанных = ЗаголовкиСтруктура.ЗаголовокДанных;
	ЗаголовокДанных = НСтр("ru = 'Объект'");
	ПредставлениеНабора = ЗаголовокДанных;
	
	СертификатыМО = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьСертификатыМОПользователя();
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("ПоказатьКомментарий",	Истина);
	ОписаниеДанных.Вставить("ИдентификаторФормы",	УникальныйИдентификатор);
	ОписаниеДанных.Вставить("Операция",				Операция);
	ОписаниеДанных.Вставить("ЗаголовокДанных",		ЗаголовокДанных);
	ОписаниеДанных.Вставить("НаборДанных",			НаборДанных);
	ОписаниеДанных.Вставить("ПредставлениеНабора",	ПредставлениеНабора);
	ОписаниеДанных.Вставить("ОтборСертификатов",	СертификатыМО);
	
	ОбработчикПродолжения = Новый ОписаниеОповещения("ПослеПодписанияОбъектов", ОбщегоНазначенияКлиент.ОбщийМодуль("доп_СертификатыЭЦПКлиент"), ПараметрыВыполнения);
	
	МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
	МодульЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, , ОбработчикПродолжения);
	
КонецПроцедуры

&НаСервере
Процедура СнятьВсеОтметкиНаСервере()
	
	СообщенияДляПодписи.Очистить();
	ДанныеМД.Параметры.УстановитьЗначениеПараметра("ОтмеченныеМД", Новый Массив());
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьНаСервере()
	
	Для Каждого ЭлементСЗ Из СообщенияДляПодписи Цикл
		Если ЗначениеЗаполнено(ЭлементСЗ.Значение)
			И Не ЗначениеЗаполнено(ЭлементСЗ.Представление)
		Тогда
			ЭлементСЗ.Представление = ЭлементСЗ.Значение.Документ;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеМД.Параметры.УстановитьЗначениеПараметра("ОтмеченныеМД", СообщенияДляПодписи.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаСервере
Процедура СнятьОтметкуНаСервере()
	
	мОтмеченныеМД = Новый Массив();
	
	Для Каждого КлючИЗначение Из СообщенияДляПодписи Цикл
		мОтмеченныеМД.Добавить(КлючИЗначение.Значение);
	КонецЦикла;
	
	ДанныеМД.Параметры.УстановитьЗначениеПараметра("ОтмеченныеМД", мОтмеченныеМД);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВсеОтметкиНаСервере()
	
	ПоявилисьНовыеОтметки = Ложь;
	
	Для Каждого СтрокаТЗ Из ОбщегоНазначенияСервер.ПолучитьДанныеДинамическогоСписка(Элементы.ДанныеМД) Цикл
		Если СообщенияДляПодписи.НайтиПоЗначению(СтрокаТЗ.Ссылка) = Неопределено Тогда
			СообщенияДляПодписи.Добавить(СтрокаТЗ.Ссылка, СтрокаТЗ.Документ);
			ПоявилисьНовыеОтметки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ПоявилисьНовыеОтметки Тогда
		ОтметитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьПредставлениеСообщенияРЭМД(Ссылка)
	
	Если Не ЗначениеЗаполнено(Ссылка) Или ТипЗнч(Ссылка) <> Тип("СправочникСсылка.СообщенияРЭМД") Тогда
		Возврат "";
	КонецЕсли;
	
	МД = Ссылка.Документ;
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(Ссылка.Документ);
	
	Если ИмяТипаДокумента = "Документ.Прием" Тогда
		Префикс = "Прием";
		ВрачСтрокой = МД.Врач.Наименование;
	ИначеЕсли ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
		Префикс = "МедКомиссия";
		ВрачСтрокой = МД.ПредседательМедКомиссии.Наименование;
	Иначе
		Префикс = "Документ";
		ВрачСтрокой = "Врач";
	КонецЕсли;
	
	ДатаСтрокой	= Формат(Ссылка.Документ.Дата, "'от' ДФ=""dd.MM.yyyy ЧЧ:мм""");
	Описание	= Ссылка.ВидДокумента.Наименование;
	
	Возврат Префикс + "   " + ДатаСтрокой + "   " + ВрачСтрокой + "   " + Описание;
	
КонецФункции

#КонецОбласти
